# ExecutedEventArgs Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExecutedEventArgs Properties
ExecutedEventArgs Class See Also
---
The ExecutedEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ActiveDocument | The active document.  (Inherited from CommandEventArgs.) |
| Cancel | Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it.  (Inherited from RevitEventArgs.) |
| Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitEventArgs.) |
| CommandId | The command id.  (Inherited from CommandEventArgs.) |

# See Also
ExecutedEventArgs Class
Autodesk.Revit.UI.Events Namespace